TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usb.h
/*@}*/ /* end of group USB_REGISTERS */

/** @addtogroup USB_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} USB_CPU_INT_Regs;

/*@}*/ /* end of group USB_CPU_INT */

/** @addtogroup USB_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00000808) Clock control */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} USB_GPRCM_Regs;

/*@}*/ /* end of group USB_GPRCM */

/** @addtogroup USB
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  USB_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[514];
  USB_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED2[37];
  __I  uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED3[6];
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  __IO uint32_t USBMODE;                           /* !< (@ 0x00001100) USB mode control */
  __IO uint32_t USBMONITOR;                        /* !< (@ 0x00001104) USB Clock Control Register */
  __IO uint32_t USBDMASEL;                         /* !< (@ 0x00001108) USB DMA trigger select */
       uint32_t RESERVED4[957];
  USB_REGISTERS_Regs  REGISTERS;                         /* !< (@ 0x00002000) */
} USB_Regs;

/*@}*/ /* end of group USB */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* USB Register Control Bits
******************************************************************************/

/* USB_TXMAXP Bits */
/* USB_TXMAXP[MAXLOAD] Bits */
#define USB_TXMAXP_MAXLOAD_OFS                   (0)                             /* !< MAXLOAD Offset */
#define USB_TXMAXP_MAXLOAD_MASK                  ((uint16_t)0x000007FFU)         /* !< Maximum Payload specifies the
                                                                                    maximum payload in bytes per
                                                                                    transaction. */

/* USB_TXCSRL Bits */
/* USB_TXCSRL[TXRDY] Bits */
#define USB_TXCSRL_TXRDY_OFS                     (0)                             /* !< TXRDY Offset */
#define USB_TXCSRL_TXRDY_MASK                    ((uint8_t)0x00000001U)          /* !< Transmit Packet Ready. The CPU sets
                                                                                    this bit after loading a data packet
                                                                                    into the FIFO.  This bit is cleared
                                                                                    automatically when a data packet has
                                                                                    been transmitted. The EPn bit in the
                                                                                    USBTXIS register is also set at this
                                                                                    point. TXRDY is also automatically
                                                                                    cleared prior to loading a second
                                                                                    packet into a double-buffered FIFO.
                                                                                    Note: Host and device mode */
#define USB_TXCSRL_TXRDY_WAIT                    ((uint8_t)0x00000000U)          /* !< No transmit packet is ready. */
#define USB_TXCSRL_TXRDY_READY                   ((uint8_t)0x00000001U)          /* !< Software sets this bit after
                                                                                    loading a data packet into the TX
                                                                                    FIFO. */
/* USB_TXCSRL[FIFONE] Bits */
#define USB_TXCSRL_FIFONE_OFS                    (1)                             /* !< FIFONE Offset */
#define USB_TXCSRL_FIFONE_MASK                   ((uint8_t)0x00000002U)          /* !< FIFO Not Empty. The USB controller
                                                                                    sets this bit when there is at least
                                                                                    1 packet in the TX FIFO. Note: Host
                                                                                    and device mode. */
#define USB_TXCSRL_FIFONE_EMPTY                  ((uint8_t)0x00000000U)          /* !< The FIFO is empty */
#define USB_TXCSRL_FIFONE_NOT_EMPTY              ((uint8_t)0x00000002U)          /* !< At least one packet is in the
                                                                                    transmit FIFO. */
/* USB_TXCSRL[UNDRNERROR] Bits */
#define USB_TXCSRL_UNDRNERROR_OFS                (2)                             /* !< UNDRNERROR Offset */
#define USB_TXCSRL_UNDRNERROR_MASK               ((uint8_t)0x00000004U)          /* !< Underrun / Error condition. Device
                                                                                    mode: The USB controller sets this
                                                                                    bit if an IN token is received when
                                                                                    TXRDY is not set. The CPU should
                                                                                    clear this bit. Host mode: The USB
                                                                                    controller sets this bit when 3
                                                                                    attempts have been made to send a
                                                                                    packet and no handshake packet has
                                                                                    been received. When the bit is set,
                                                                                    an interrupt is generated, TXRDY is
                                                                                    cleared and the FIFO is completely
                                                                                    flushed. The CPU should clear this
                                                                                    bit. Valid only when the endpoint is
                                                                                    operating in Bulk or Interrupt mode. */
#define USB_TXCSRL_UNDRNERROR_CLEAR              ((uint8_t)0x00000000U)          /* !< No underrun or error condition */
#define USB_TXCSRL_UNDRNERROR_SET                ((uint8_t)0x00000004U)          /* !< Underrun or error condition exist. */
/* USB_TXCSRL[FLUSH] Bits */
#define USB_TXCSRL_FLUSH_OFS                     (3)                             /* !< FLUSH Offset */
#define USB_TXCSRL_FLUSH_MASK                    ((uint8_t)0x00000008U)          /* !< Flush FIFO. The CPU writes a 1 to
                                                                                    this bit to flush the latest packet
                                                                                    from the endpoint TX FIFO. The FIFO
                                                                                    pointer is reset, the TXRDY bit is
                                                                                    cleared and an interrupt is
                                                                                    generated. May be set simultaneously
                                                                                    with TXRDY to abort the packet that
                                                                                    is currently being loaded into the
                                                                                    FIFO.  Note: FLUSH should only be
                                                                                    used when TXRDY is set. At other
                                                                                    times, it may cause data to be
                                                                                    corrupted. Also note that, if the
                                                                                    FIFO is double-buffered, FLUSH may
                                                                                    need to be set twice to completely
                                                                                    clear the FIFO. Note: Host and device
                                                                                    mode. */
#define USB_TXCSRL_FLUSH_NO_EFFECT               ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TXCSRL_FLUSH_EFFECT                  ((uint8_t)0x00000008U)          /* !< Flushes the latest packet from the
                                                                                    endpoint transmit FIFO. */
/* USB_TXCSRL[STALLSETUP] Bits */
#define USB_TXCSRL_STALLSETUP_OFS                (4)                             /* !< STALLSETUP Offset */
#define USB_TXCSRL_STALLSETUP_MASK               ((uint8_t)0x00000010U)          /* !< Send stall / Setup packet request.
                                                                                    Device mode: The CPU writes a 1 to
                                                                                    this bit to issue a STALL handshake
                                                                                    to an IN token. The CPU clears this
                                                                                    bit to terminate the stall condition.
                                                                                    Note: This bit has no effect where
                                                                                    the endpoint is being used for
                                                                                    Isochronous transfers. Host mode: The
                                                                                    CPU sets this bit, at the same time
                                                                                    as the TXRDY bit is set, to send a
                                                                                    SETUP token instead of an OUT token
                                                                                    for the transaction. Note: Setting
                                                                                    this bit also clears the USBTXCSRH.DT
                                                                                    register. */
#define USB_TXCSRL_STALLSETUP_CLEAR              ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TXCSRL_STALLSETUP_SET                ((uint8_t)0x00000010U)          /* !< Send stall or setup packet request. */
/* USB_TXCSRL[STALLED] Bits */
#define USB_TXCSRL_STALLED_OFS                   (5)                             /* !< STALLED Offset */
#define USB_TXCSRL_STALLED_MASK                  ((uint8_t)0x00000020U)          /* !< Sent stall / RX stalled. Device
                                                                                    mode: This bit is set when a STALL
                                                                                    handshake is transmitted. The FIFO is
                                                                                    flushed and the TXRDY bit is cleared.
                                                                                    The CPU should clear this bit. Host
                                                                                    mode: This bit is set when a STALL
                                                                                    handshake is received. When this bit
                                                                                    is set, any DMA request that is in
                                                                                    progress is stopped, the FIFO is
                                                                                    completely flushed and the TXRDY bit
                                                                                    is cleared. The CPU should clear this
                                                                                    bit. */
#define USB_TXCSRL_STALLED_CLEAR                 ((uint8_t)0x00000000U)          /* !< Clear stall indication. */
#define USB_TXCSRL_STALLED_SET                   ((uint8_t)0x00000020U)          /* !< Indicates that a STALL handshake
                                                                                    has been sent or received. */
/* USB_TXCSRL[CLRDT] Bits */
#define USB_TXCSRL_CLRDT_OFS                     (6)                             /* !< CLRDT Offset */
#define USB_TXCSRL_CLRDT_MASK                    ((uint8_t)0x00000040U)          /* !< Clear DataToggle. The CPU writes a
                                                                                    1 to this bit to reset the endpoint
                                                                                    data toggle to 0. Note: Host and
                                                                                    device mode. */
#define USB_TXCSRL_CLRDT_NO_EFFECT               ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TXCSRL_CLRDT_EFFECT                  ((uint8_t)0x00000040U)          /* !< Writing a 1 to this bit clears the
                                                                                    DT bit in the USBTXCSRH[n] register. */
/* USB_TXCSRL[INCOMPNAKTO] Bits */
#define USB_TXCSRL_INCOMPNAKTO_OFS               (7)                             /* !< INCOMPNAKTO Offset */
#define USB_TXCSRL_INCOMPNAKTO_MASK              ((uint8_t)0x00000080U)          /* !< Incomplete TX / NAK Timeout. Device
                                                                                    mode: When the endpoint is being used
                                                                                    for high-bandwidth Isochronous, this
                                                                                    bit is set to indicate where a large
                                                                                    packet has been split into 2 or 3
                                                                                    packets for transmission but
                                                                                    insufficient IN tokens have been
                                                                                    received to send all the parts. Note:
                                                                                    In anything other than isochronous
                                                                                    transfers, this bit will always
                                                                                    return 0. Host mode - bulk endpoints
                                                                                    only: This bit will be set when the
                                                                                    TX endpoint is halted following the
                                                                                    receipt of NAK responses for longer
                                                                                    than the time set as theTXPOLLNAKLMT
                                                                                    by the TXINTERVAL register. The CPU
                                                                                    should clear this bit to allow the
                                                                                    endpoint to continue. Host mode -
                                                                                    high-bandwidth Interrupt endpoints
                                                                                    only: This bit will be set if no
                                                                                    response is received from the device
                                                                                    to which the packet is being sent. */
#define USB_TXCSRL_INCOMPNAKTO_CLEAR             ((uint8_t)0x00000000U)          /* !< No condition present / clear
                                                                                    condition. */
#define USB_TXCSRL_INCOMPNAKTO_SET               ((uint8_t)0x00000080U)          /* !< Condition present. */

