TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usb.h
/* USB_CSR0H Bits */
/* USB_CSR0H[FLUSH] Bits */
#define USB_CSR0H_FLUSH_OFS                      (0)                             /* !< FLUSH Offset */
#define USB_CSR0H_FLUSH_MASK                     ((uint8_t)0x00000001U)          /* !< Flush FIFO. The CPU writes a 1 to
                                                                                    this bit to flush the next packet to
                                                                                    be transmitted/read from the Endpoint
                                                                                    0 FIFO. The FIFO pointer is reset and
                                                                                    the TXRDY/RXRDY bit in the USBCSRL0
                                                                                    register is cleared. Note: FLUSH
                                                                                    should only be used when TXRDY/RXRDY
                                                                                    is set. At other times, it may cause
                                                                                    data to be corrupted. */
#define USB_CSR0H_FLUSH_NO_EFFECT                ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_CSR0H_FLUSH_EFFECT                   ((uint8_t)0x00000001U)          /* !< Flush the FIFO */
/* USB_CSR0H[DT] Bits */
#define USB_CSR0H_DT_OFS                         (1)                             /* !< DT Offset */
#define USB_CSR0H_DT_MASK                        ((uint8_t)0x00000002U)          /* !< Data Toggle. When read, this bit
                                                                                    indicates the current state of the
                                                                                    endpoint 0 data toggle. If DTWE is
                                                                                    set, this bit may be written with the
                                                                                    required setting of the data toggle.
                                                                                    If DTWE is Low, this bit cannot be
                                                                                    written. Care should be taken when
                                                                                    writing to this bit as it should only
                                                                                    be changed to RESET USB endpoint 0.
                                                                                    Note: This bit is only effective in
                                                                                    host mode. */
#define USB_CSR0H_DT_LOW                         ((uint8_t)0x00000000U)          /* !< Data toggle is low */
#define USB_CSR0H_DT_HIGH                        ((uint8_t)0x00000002U)          /* !< Data toggle is high */
/* USB_CSR0H[DTWE] Bits */
#define USB_CSR0H_DTWE_OFS                       (2)                             /* !< DTWE Offset */
#define USB_CSR0H_DTWE_MASK                      ((uint8_t)0x00000004U)          /* !< Data Toggle Write Enable. This bit
                                                                                    is automatically cleared once the new
                                                                                    value is written. Note: This bit is
                                                                                    only effective in host mode. */
#define USB_CSR0H_DTWE_DISABLE                   ((uint8_t)0x00000000U)          /* !< The DT bit cannot be written. */
#define USB_CSR0H_DTWE_ENABLE                    ((uint8_t)0x00000004U)          /* !< Enables the current state of the
                                                                                    endpoint 0 data toggle to be written
                                                                                    (see DT bit). */
/* USB_CSR0H[DISPING] Bits */
#define USB_CSR0H_DISPING_OFS                    (3)                             /* !< DISPING Offset */
#define USB_CSR0H_DISPING_MASK                   ((uint8_t)0x00000008U)          /* !< Diable PING tokens in data and
                                                                                    status phases of a high-speed Control
                                                                                    transfer. */
#define USB_CSR0H_DISPING_CLR                    ((uint8_t)0x00000000U)          /* !< Ping is allowed. */
#define USB_CSR0H_DISPING_SET                    ((uint8_t)0x00000008U)          /* !< Ping is not allowed. */

/* USB_COUNT0 Bits */
/* USB_COUNT0[COUNT] Bits */
#define USB_COUNT0_COUNT_OFS                     (0)                             /* !< COUNT Offset */
#define USB_COUNT0_COUNT_MASK                    ((uint8_t)0x0000007FU)          /* !< FIFO Count. COUNT is a read-only
                                                                                    value that indicates the number of
                                                                                    received data bytes in the endpoint 0
                                                                                    FIFO. The value returned changes as
                                                                                    the contents of the FIFO change and
                                                                                    is only valid while RXRDY
                                                                                    (USBCSRL.RXRDY) is set. */

/* USB_TYPE0 Bits */
/* USB_TYPE0[SPEED] Bits */
#define USB_TYPE0_SPEED_OFS                      (6)                             /* !< SPEED Offset */
#define USB_TYPE0_SPEED_MASK                     ((uint8_t)0x000000C0U)          /* !< Operating Speed specifies the
                                                                                    operating speed of the target Device.
                                                                                    If selected, the target is assumed
                                                                                    #br#to have the same connection speed
                                                                                    as the USB controller. */
#define USB_TYPE0_SPEED_UNUSED                   ((uint8_t)0x00000000U)          /* !< Unused (Note: If selected, the
                                                                                    target will be assumed to be using
                                                                                    the same connection speed as the USB
                                                                                    controller.) */
#define USB_TYPE0_SPEED_FULL                     ((uint8_t)0x00000080U)          /* !< Full-speed */
#define USB_TYPE0_SPEED_LOW                      ((uint8_t)0x000000C0U)          /* !< Low-speed */

/* USB_NAKLMT0 Bits */
/* USB_NAKLMT0[NAKLMT] Bits */
#define USB_NAKLMT0_NAKLMT_OFS                   (0)                             /* !< NAKLMT Offset */
#define USB_NAKLMT0_NAKLMT_MASK                  ((uint8_t)0x0000001FU)          /* !< EP0 NAK Limit specifies the number
                                                                                    of frames after receiving a stream of
                                                                                    NAK responses. */

/* USB_CONFIG Bits */
/* USB_CONFIG[UTMIDATWDTH] Bits */
#define USB_CONFIG_UTMIDATWDTH_OFS               (0)                             /* !< UTMIDATWDTH Offset */
#define USB_CONFIG_UTMIDATWDTH_MASK              ((uint8_t)0x00000001U)          /* !< Indicates selected UTMI+ data
                                                                                    width. Always 0 indicating 8 bits. */
/* USB_CONFIG[SOFTCON] Bits */
#define USB_CONFIG_SOFTCON_OFS                   (1)                             /* !< SOFTCON Offset */
#define USB_CONFIG_SOFTCON_MASK                  ((uint8_t)0x00000002U)          /* !< Always 1 . Indicates Soft
                                                                                    Connect/Disconnect is enabled. */
/* USB_CONFIG[DYNFIFO] Bits */
#define USB_CONFIG_DYNFIFO_OFS                   (2)                             /* !< DYNFIFO Offset */
#define USB_CONFIG_DYNFIFO_MASK                  ((uint8_t)0x00000004U)          /* !< When set to 1 indicates Dynamic
                                                                                    FIFO Sizing option selected. */
/* USB_CONFIG[HBTXE] Bits */
#define USB_CONFIG_HBTXE_OFS                     (3)                             /* !< HBTXE Offset */
#define USB_CONFIG_HBTXE_MASK                    ((uint8_t)0x00000008U)          /* !< When set to 1 indicates
                                                                                    High-bandwidth TX ISO Endpoint
                                                                                    Support selected. */
/* USB_CONFIG[HBRXE] Bits */
#define USB_CONFIG_HBRXE_OFS                     (4)                             /* !< HBRXE Offset */
#define USB_CONFIG_HBRXE_MASK                    ((uint8_t)0x00000010U)          /* !< When set to 1 indicates
                                                                                    High-bandwidth Rx ISO Endpoint
                                                                                    Support selected. */
/* USB_CONFIG[BIGENDIAN] Bits */
#define USB_CONFIG_BIGENDIAN_OFS                 (5)                             /* !< BIGENDIAN Offset */
#define USB_CONFIG_BIGENDIAN_MASK                ((uint8_t)0x00000020U)          /* !< Always '0'. Indicates Little Endian
                                                                                    ordering. */
/* USB_CONFIG[MPTXE] Bits */
#define USB_CONFIG_MPTXE_OFS                     (6)                             /* !< MPTXE Offset */
#define USB_CONFIG_MPTXE_MASK                    ((uint8_t)0x00000040U)          /* !< When set to 1, automatic splitting
                                                                                    of bulk packets is selected. */
/* USB_CONFIG[MPRXE] Bits */
#define USB_CONFIG_MPRXE_OFS                     (7)                             /* !< MPRXE Offset */
#define USB_CONFIG_MPRXE_MASK                    ((uint8_t)0x00000080U)          /* !< When set to 1, automatic
                                                                                    amalgamation of bulk packets is
                                                                                    selected. */

/* USB_RQPKTCOUNT Bits */
/* USB_RQPKTCOUNT[COUNT] Bits */
#define USB_RQPKTCOUNT_COUNT_OFS                 (0)                             /* !< COUNT Offset */
#define USB_RQPKTCOUNT_COUNT_MASK                ((uint32_t)0x0000FFFFU)         /* !< Block Transfer Packet Count sets
                                                                                    the number of packets of the size
                                                                                    defined by the MAXLOAD bit field that
                                                                                    are to be transferred in a block
                                                                                    transfer. Note: This is only used in
                                                                                    Host mode when AUTORQ is set. The bit
                                                                                    has no effect in Device mode or when
                                                                                    AUTORQ is not set. */

/* USB_RXDPKTBUFDIS Bits */
/* USB_RXDPKTBUFDIS[EP1] Bits */
#define USB_RXDPKTBUFDIS_EP1_OFS                 (1)                             /* !< EP1 Offset */
#define USB_RXDPKTBUFDIS_EP1_MASK                ((uint16_t)0x00000002U)         /* !< EP1 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP1_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP1_ENABLE              ((uint16_t)0x00000002U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP2] Bits */
#define USB_RXDPKTBUFDIS_EP2_OFS                 (2)                             /* !< EP2 Offset */
#define USB_RXDPKTBUFDIS_EP2_MASK                ((uint16_t)0x00000004U)         /* !< EP2 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP2_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP2_ENABLE              ((uint16_t)0x00000004U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP3] Bits */
#define USB_RXDPKTBUFDIS_EP3_OFS                 (3)                             /* !< EP3 Offset */
#define USB_RXDPKTBUFDIS_EP3_MASK                ((uint16_t)0x00000008U)         /* !< EP3 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP3_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP3_ENABLE              ((uint16_t)0x00000008U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP4] Bits */
#define USB_RXDPKTBUFDIS_EP4_OFS                 (4)                             /* !< EP4 Offset */
#define USB_RXDPKTBUFDIS_EP4_MASK                ((uint16_t)0x00000010U)         /* !< EP4 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP4_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP4_ENABLE              ((uint16_t)0x00000010U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP5] Bits */
#define USB_RXDPKTBUFDIS_EP5_OFS                 (5)                             /* !< EP5 Offset */
#define USB_RXDPKTBUFDIS_EP5_MASK                ((uint16_t)0x00000020U)         /* !< EP5 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP5_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP5_ENABLE              ((uint16_t)0x00000020U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP6] Bits */
#define USB_RXDPKTBUFDIS_EP6_OFS                 (6)                             /* !< EP6 Offset */
#define USB_RXDPKTBUFDIS_EP6_MASK                ((uint16_t)0x00000040U)         /* !< EP6 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP6_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP6_ENABLE              ((uint16_t)0x00000040U)         /* !< Enables double-packet buffering. */
/* USB_RXDPKTBUFDIS[EP7] Bits */
#define USB_RXDPKTBUFDIS_EP7_OFS                 (7)                             /* !< EP7 Offset */
#define USB_RXDPKTBUFDIS_EP7_MASK                ((uint16_t)0x00000080U)         /* !< EP7 RX Double Packet Buffer Disable */
#define USB_RXDPKTBUFDIS_EP7_DISABLE             ((uint16_t)0x00000000U)         /* !< Disables double-packet buffering. */
#define USB_RXDPKTBUFDIS_EP7_ENABLE              ((uint16_t)0x00000080U)         /* !< Enables double-packet buffering. */

