TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usb.h
/* USB_MIS Bits */
/* USB_MIS[INTRTX] Bits */
#define USB_MIS_INTRTX_OFS                       (0)                             /* !< INTRTX Offset */
#define USB_MIS_INTRTX_MASK                      ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_MIS_INTRTX_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_INTRTX_SET                       ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* USB_MIS[INTRRX] Bits */
#define USB_MIS_INTRRX_OFS                       (1)                             /* !< INTRRX Offset */
#define USB_MIS_INTRRX_MASK                      ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_MIS_INTRRX_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_INTRRX_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* USB_MIS[INTRUSB] Bits */
#define USB_MIS_INTRUSB_OFS                      (2)                             /* !< INTRUSB Offset */
#define USB_MIS_INTRUSB_MASK                     ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USB_MIS_INTRUSB_CLR                      ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_INTRUSB_SET                      ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* USB_MIS[VUSBPWRDN] Bits */
#define USB_MIS_VUSBPWRDN_OFS                    (3)                             /* !< VUSBPWRDN Offset */
#define USB_MIS_VUSBPWRDN_MASK                   ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USB_MIS_VUSBPWRDN_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_VUSBPWRDN_SET                    ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEARX] Bits */
#define USB_MIS_DMADONEARX_OFS                   (4)                             /* !< DMADONEARX Offset */
#define USB_MIS_DMADONEARX_MASK                  ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_MIS_DMADONEARX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEARX_SET                   ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEATX] Bits */
#define USB_MIS_DMADONEATX_OFS                   (5)                             /* !< DMADONEATX Offset */
#define USB_MIS_DMADONEATX_MASK                  ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_MIS_DMADONEATX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEATX_SET                   ((uint32_t)0x00000020U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEBRX] Bits */
#define USB_MIS_DMADONEBRX_OFS                   (6)                             /* !< DMADONEBRX Offset */
#define USB_MIS_DMADONEBRX_MASK                  ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_MIS_DMADONEBRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEBRX_SET                   ((uint32_t)0x00000040U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEBTX] Bits */
#define USB_MIS_DMADONEBTX_OFS                   (7)                             /* !< DMADONEBTX Offset */
#define USB_MIS_DMADONEBTX_MASK                  ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_MIS_DMADONEBTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEBTX_SET                   ((uint32_t)0x00000080U)         /* !< Interrupt occured */
/* USB_MIS[DMADONECRX] Bits */
#define USB_MIS_DMADONECRX_OFS                   (8)                             /* !< DMADONECRX Offset */
#define USB_MIS_DMADONECRX_MASK                  ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_MIS_DMADONECRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONECRX_SET                   ((uint32_t)0x00000100U)         /* !< Interrupt occured */
/* USB_MIS[DMADONECTX] Bits */
#define USB_MIS_DMADONECTX_OFS                   (9)                             /* !< DMADONECTX Offset */
#define USB_MIS_DMADONECTX_MASK                  ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_MIS_DMADONECTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONECTX_SET                   ((uint32_t)0x00000200U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEDRX] Bits */
#define USB_MIS_DMADONEDRX_OFS                   (10)                            /* !< DMADONEDRX Offset */
#define USB_MIS_DMADONEDRX_MASK                  ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_MIS_DMADONEDRX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEDRX_SET                   ((uint32_t)0x00000400U)         /* !< Interrupt occured */
/* USB_MIS[DMADONEDTX] Bits */
#define USB_MIS_DMADONEDTX_OFS                   (11)                            /* !< DMADONEDTX Offset */
#define USB_MIS_DMADONEDTX_MASK                  ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_MIS_DMADONEDTX_CLR                   ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMADONEDTX_SET                   ((uint32_t)0x00000800U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREARX] Bits */
#define USB_MIS_DMAPREARX_OFS                    (12)                            /* !< DMAPREARX Offset */
#define USB_MIS_DMAPREARX_MASK                   ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_MIS_DMAPREARX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREARX_SET                    ((uint32_t)0x00001000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREATX] Bits */
#define USB_MIS_DMAPREATX_OFS                    (13)                            /* !< DMAPREATX Offset */
#define USB_MIS_DMAPREATX_MASK                   ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_MIS_DMAPREATX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREATX_SET                    ((uint32_t)0x00002000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREBRX] Bits */
#define USB_MIS_DMAPREBRX_OFS                    (14)                            /* !< DMAPREBRX Offset */
#define USB_MIS_DMAPREBRX_MASK                   ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_MIS_DMAPREBRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREBRX_SET                    ((uint32_t)0x00004000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREBTX] Bits */
#define USB_MIS_DMAPREBTX_OFS                    (15)                            /* !< DMAPREBTX Offset */
#define USB_MIS_DMAPREBTX_MASK                   ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_MIS_DMAPREBTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREBTX_SET                    ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPRECRX] Bits */
#define USB_MIS_DMAPRECRX_OFS                    (16)                            /* !< DMAPRECRX Offset */
#define USB_MIS_DMAPRECRX_MASK                   ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_MIS_DMAPRECRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPRECRX_SET                    ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPRECTX] Bits */
#define USB_MIS_DMAPRECTX_OFS                    (17)                            /* !< DMAPRECTX Offset */
#define USB_MIS_DMAPRECTX_MASK                   ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_MIS_DMAPRECTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPRECTX_SET                    ((uint32_t)0x00020000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREDRX] Bits */
#define USB_MIS_DMAPREDRX_OFS                    (18)                            /* !< DMAPREDRX Offset */
#define USB_MIS_DMAPREDRX_MASK                   ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_MIS_DMAPREDRX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREDRX_SET                    ((uint32_t)0x00040000U)         /* !< Interrupt occured */
/* USB_MIS[DMAPREDTX] Bits */
#define USB_MIS_DMAPREDTX_OFS                    (19)                            /* !< DMAPREDTX Offset */
#define USB_MIS_DMAPREDTX_MASK                   ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_MIS_DMAPREDTX_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define USB_MIS_DMAPREDTX_SET                    ((uint32_t)0x00080000U)         /* !< Interrupt occured */

/* USB_ISET Bits */
/* USB_ISET[INTRTX] Bits */
#define USB_ISET_INTRTX_OFS                      (0)                             /* !< INTRTX Offset */
#define USB_ISET_INTRTX_MASK                     ((uint32_t)0x00000001U)         /* !< Endpoint 0 and the TX Endpoints
                                                                                    interrupt */
#define USB_ISET_INTRTX_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_INTRTX_SET                      ((uint32_t)0x00000001U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[INTRRX] Bits */
#define USB_ISET_INTRRX_OFS                      (1)                             /* !< INTRRX Offset */
#define USB_ISET_INTRRX_MASK                     ((uint32_t)0x00000002U)         /* !< RX Endpoints interrupt */
#define USB_ISET_INTRRX_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_INTRRX_SET                      ((uint32_t)0x00000002U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[INTRUSB] Bits */
#define USB_ISET_INTRUSB_OFS                     (2)                             /* !< INTRUSB Offset */
#define USB_ISET_INTRUSB_MASK                    ((uint32_t)0x00000004U)         /* !< USB Interrupts */
#define USB_ISET_INTRUSB_NO_EFFECT               ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_INTRUSB_SET                     ((uint32_t)0x00000004U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[VUSBPWRDN] Bits */
#define USB_ISET_VUSBPWRDN_OFS                   (3)                             /* !< VUSBPWRDN Offset */
#define USB_ISET_VUSBPWRDN_MASK                  ((uint32_t)0x00000008U)         /* !< VUSB Power Down */
#define USB_ISET_VUSBPWRDN_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_VUSBPWRDN_SET                   ((uint32_t)0x00000008U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEARX] Bits */
#define USB_ISET_DMADONEARX_OFS                  (4)                             /* !< DMADONEARX Offset */
#define USB_ISET_DMADONEARX_MASK                 ((uint32_t)0x00000010U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_ISET_DMADONEARX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEARX_SET                  ((uint32_t)0x00000010U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEATX] Bits */
#define USB_ISET_DMADONEATX_OFS                  (5)                             /* !< DMADONEATX Offset */
#define USB_ISET_DMADONEATX_MASK                 ((uint32_t)0x00000020U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_ISET_DMADONEATX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEATX_SET                  ((uint32_t)0x00000020U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEBRX] Bits */
#define USB_ISET_DMADONEBRX_OFS                  (6)                             /* !< DMADONEBRX Offset */
#define USB_ISET_DMADONEBRX_MASK                 ((uint32_t)0x00000040U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_ISET_DMADONEBRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEBRX_SET                  ((uint32_t)0x00000040U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEBTX] Bits */
#define USB_ISET_DMADONEBTX_OFS                  (7)                             /* !< DMADONEBTX Offset */
#define USB_ISET_DMADONEBTX_MASK                 ((uint32_t)0x00000080U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_ISET_DMADONEBTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEBTX_SET                  ((uint32_t)0x00000080U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONECRX] Bits */
#define USB_ISET_DMADONECRX_OFS                  (8)                             /* !< DMADONECRX Offset */
#define USB_ISET_DMADONECRX_MASK                 ((uint32_t)0x00000100U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_ISET_DMADONECRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONECRX_SET                  ((uint32_t)0x00000100U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONECTX] Bits */
#define USB_ISET_DMADONECTX_OFS                  (9)                             /* !< DMADONECTX Offset */
#define USB_ISET_DMADONECTX_MASK                 ((uint32_t)0x00000200U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_ISET_DMADONECTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONECTX_SET                  ((uint32_t)0x00000200U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEDRX] Bits */
#define USB_ISET_DMADONEDRX_OFS                  (10)                            /* !< DMADONEDRX Offset */
#define USB_ISET_DMADONEDRX_MASK                 ((uint32_t)0x00000400U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_ISET_DMADONEDRX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEDRX_SET                  ((uint32_t)0x00000400U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMADONEDTX] Bits */
#define USB_ISET_DMADONEDTX_OFS                  (11)                            /* !< DMADONEDTX Offset */
#define USB_ISET_DMADONEDTX_MASK                 ((uint32_t)0x00000800U)         /* !< DMA-Done interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_ISET_DMADONEDTX_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMADONEDTX_SET                  ((uint32_t)0x00000800U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREARX] Bits */
#define USB_ISET_DMAPREARX_OFS                   (12)                            /* !< DMAPREARX Offset */
#define USB_ISET_DMAPREARX_MASK                  ((uint32_t)0x00001000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-RX */
#define USB_ISET_DMAPREARX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREARX_SET                   ((uint32_t)0x00001000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREATX] Bits */
#define USB_ISET_DMAPREATX_OFS                   (13)                            /* !< DMAPREATX Offset */
#define USB_ISET_DMAPREATX_MASK                  ((uint32_t)0x00002000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-A-TX */
#define USB_ISET_DMAPREATX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREATX_SET                   ((uint32_t)0x00002000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREBRX] Bits */
#define USB_ISET_DMAPREBRX_OFS                   (14)                            /* !< DMAPREBRX Offset */
#define USB_ISET_DMAPREBRX_MASK                  ((uint32_t)0x00004000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-RX */
#define USB_ISET_DMAPREBRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREBRX_SET                   ((uint32_t)0x00004000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREBTX] Bits */
#define USB_ISET_DMAPREBTX_OFS                   (15)                            /* !< DMAPREBTX Offset */
#define USB_ISET_DMAPREBTX_MASK                  ((uint32_t)0x00008000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-B-TX */
#define USB_ISET_DMAPREBTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREBTX_SET                   ((uint32_t)0x00008000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPRECRX] Bits */
#define USB_ISET_DMAPRECRX_OFS                   (16)                            /* !< DMAPRECRX Offset */
#define USB_ISET_DMAPRECRX_MASK                  ((uint32_t)0x00010000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-RX */
#define USB_ISET_DMAPRECRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPRECRX_SET                   ((uint32_t)0x00010000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPRECTX] Bits */
#define USB_ISET_DMAPRECTX_OFS                   (17)                            /* !< DMAPRECTX Offset */
#define USB_ISET_DMAPRECTX_MASK                  ((uint32_t)0x00020000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-C-TX */
#define USB_ISET_DMAPRECTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPRECTX_SET                   ((uint32_t)0x00020000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREDRX] Bits */
#define USB_ISET_DMAPREDRX_OFS                   (18)                            /* !< DMAPREDRX Offset */
#define USB_ISET_DMAPREDRX_MASK                  ((uint32_t)0x00040000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-RX */
#define USB_ISET_DMAPREDRX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREDRX_SET                   ((uint32_t)0x00040000U)         /* !< Write 1 to set the interrupt */
/* USB_ISET[DMAPREDTX] Bits */
#define USB_ISET_DMAPREDTX_OFS                   (19)                            /* !< DMAPREDTX Offset */
#define USB_ISET_DMAPREDTX_MASK                  ((uint32_t)0x00080000U)         /* !< DMA-Pre interrupt for Trigger
                                                                                    USB-D-TX */
#define USB_ISET_DMAPREDTX_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has No Effect */
#define USB_ISET_DMAPREDTX_SET                   ((uint32_t)0x00080000U)         /* !< Write 1 to set the interrupt */

