TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_usb.h
/* USB_EVT_MODE Bits */
/* USB_EVT_MODE[EVT0_CFG] Bits */
#define USB_EVT_MODE_EVT0_CFG_OFS                (0)                             /* !< EVT0_CFG Offset */
#define USB_EVT_MODE_EVT0_CFG_MASK               ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    (IPSTANDARD.INT_EVENT)(0) */
#define USB_EVT_MODE_EVT0_CFG_DISABLE            ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define USB_EVT_MODE_EVT0_CFG_SOFTWARE           ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define USB_EVT_MODE_EVT0_CFG_HARDWARE           ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

/* USB_DESC Bits */
/* USB_DESC[MINREV] Bits */
#define USB_DESC_MINREV_OFS                      (0)                             /* !< MINREV Offset */
#define USB_DESC_MINREV_MASK                     ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define USB_DESC_MINREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define USB_DESC_MINREV_MAXIMUM                  ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* USB_DESC[MAJREV] Bits */
#define USB_DESC_MAJREV_OFS                      (4)                             /* !< MAJREV Offset */
#define USB_DESC_MAJREV_MASK                     ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define USB_DESC_MAJREV_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define USB_DESC_MAJREV_MAXIMUM                  ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* USB_DESC[FEATUREVER] Bits */
#define USB_DESC_FEATUREVER_OFS                  (12)                            /* !< FEATUREVER Offset */
#define USB_DESC_FEATUREVER_MASK                 ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define USB_DESC_FEATUREVER_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define USB_DESC_FEATUREVER_MAXIMUM              ((uint32_t)0x0000F000U)         /* !< Highest possible value */
/* USB_DESC[MODULEID] Bits */
#define USB_DESC_MODULEID_OFS                    (16)                            /* !< MODULEID Offset */
#define USB_DESC_MODULEID_MASK                   ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define USB_DESC_MODULEID_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define USB_DESC_MODULEID_MAXIMUM                ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* USB_USBMODE Bits */
/* USB_USBMODE[HOST] Bits */
#define USB_USBMODE_HOST_OFS                     (0)                             /* !< HOST Offset */
#define USB_USBMODE_HOST_MASK                    ((uint32_t)0x00000001U)         /* !< USB is configured as HOST mode */
#define USB_USBMODE_HOST_DISABLE                 ((uint32_t)0x00000000U)         /* !< USB is configured as DEVICE or
                                                                                    HOST. */
#define USB_USBMODE_HOST_ENABLE                  ((uint32_t)0x00000001U)         /* !< USB is configured as HOST */
/* USB_USBMODE[DEVICEONLY] Bits */
#define USB_USBMODE_DEVICEONLY_OFS               (1)                             /* !< DEVICEONLY Offset */
#define USB_USBMODE_DEVICEONLY_MASK              ((uint32_t)0x00000002U)         /* !< USB is configured as DEVICE_ONLY
                                                                                    mode */
#define USB_USBMODE_DEVICEONLY_DISABLE           ((uint32_t)0x00000000U)         /* !< USB is configured as DEVICE or
                                                                                    HOST. */
#define USB_USBMODE_DEVICEONLY_ENABLE            ((uint32_t)0x00000002U)         /* !< USB is configured as DEVICE only
                                                                                    mode. */
/* USB_USBMODE[PHYMODE] Bits */
#define USB_USBMODE_PHYMODE_OFS                  (4)                             /* !< PHYMODE Offset */
#define USB_USBMODE_PHYMODE_MASK                 ((uint32_t)0x00000010U)         /* !< USB PHY mode.  Defines whether
                                                                                    DP/DM pins are controled by USB
                                                                                    module or IOMUX/GPIO module. */
#define USB_USBMODE_PHYMODE_GPIO                 ((uint32_t)0x00000000U)         /* !< The DP/DM pins are assighed to
                                                                                    IOMUX/GPIO module, */
#define USB_USBMODE_PHYMODE_USB                  ((uint32_t)0x00000010U)         /* !< The DP/DM pins are assighed to USB
                                                                                    module. */

/* USB_USBMONITOR Bits */
/* USB_USBMONITOR[VUSBEN] Bits */
#define USB_USBMONITOR_VUSBEN_OFS                (0)                             /* !< VUSBEN Offset */
#define USB_USBMONITOR_VUSBEN_MASK               ((uint32_t)0x00000001U)         /* !< Enable the 1/3 resistor divider for
                                                                                    VUSB supply. Set this bit to monitor
                                                                                    the VUSB supply with the ADC. */
#define USB_USBMONITOR_VUSBEN_DISABLE            ((uint32_t)0x00000000U)         /* !< VUSB monitor disabled */
#define USB_USBMONITOR_VUSBEN_ENABLE             ((uint32_t)0x00000001U)         /* !< VUSB monitor enabled */

/* USB_USBDMASEL Bits */
/* USB_USBDMASEL[TRIGARX] Bits */
#define USB_USBDMASEL_TRIGARX_OFS                (0)                             /* !< TRIGARX Offset */
#define USB_USBDMASEL_TRIGARX_MASK               ((uint32_t)0x00000007U)         /* !< TRIG A RX select specifies the RX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-A-RX */
#define USB_USBDMASEL_TRIGARX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGARX_EP1                ((uint32_t)0x00000001U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGARX_EP2                ((uint32_t)0x00000002U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGARX_EP3                ((uint32_t)0x00000003U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGARX_EP4                ((uint32_t)0x00000004U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGARX_EP5                ((uint32_t)0x00000005U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGARX_EP6                ((uint32_t)0x00000006U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGARX_EP7                ((uint32_t)0x00000007U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGATX] Bits */
#define USB_USBDMASEL_TRIGATX_OFS                (4)                             /* !< TRIGATX Offset */
#define USB_USBDMASEL_TRIGATX_MASK               ((uint32_t)0x00000070U)         /* !< TRIG A TX select specifies the TX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-A-TX */
#define USB_USBDMASEL_TRIGATX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGATX_EP1                ((uint32_t)0x00000010U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGATX_EP2                ((uint32_t)0x00000020U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGATX_EP3                ((uint32_t)0x00000030U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGATX_EP4                ((uint32_t)0x00000040U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGATX_EP5                ((uint32_t)0x00000050U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGATX_EP6                ((uint32_t)0x00000060U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGATX_EP7                ((uint32_t)0x00000070U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGBRX] Bits */
#define USB_USBDMASEL_TRIGBRX_OFS                (8)                             /* !< TRIGBRX Offset */
#define USB_USBDMASEL_TRIGBRX_MASK               ((uint32_t)0x00000700U)         /* !< TRIG B RX select specifies the RX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-B-RX */
#define USB_USBDMASEL_TRIGBRX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGBRX_EP1                ((uint32_t)0x00000100U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGBRX_EP2                ((uint32_t)0x00000200U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGBRX_EP3                ((uint32_t)0x00000300U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGBRX_EP4                ((uint32_t)0x00000400U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGBRX_EP5                ((uint32_t)0x00000500U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGBRX_EP6                ((uint32_t)0x00000600U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGBRX_EP7                ((uint32_t)0x00000700U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGBTX] Bits */
#define USB_USBDMASEL_TRIGBTX_OFS                (12)                            /* !< TRIGBTX Offset */
#define USB_USBDMASEL_TRIGBTX_MASK               ((uint32_t)0x00007000U)         /* !< TRIG B TX select specifies the TX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-B-TX */
#define USB_USBDMASEL_TRIGBTX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGBTX_EP1                ((uint32_t)0x00001000U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGBTX_EP2                ((uint32_t)0x00002000U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGBTX_EP3                ((uint32_t)0x00003000U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGBTX_EP4                ((uint32_t)0x00004000U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGBTX_EP5                ((uint32_t)0x00005000U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGBTX_EP6                ((uint32_t)0x00006000U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGBTX_EP7                ((uint32_t)0x00007000U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGCRX] Bits */
#define USB_USBDMASEL_TRIGCRX_OFS                (16)                            /* !< TRIGCRX Offset */
#define USB_USBDMASEL_TRIGCRX_MASK               ((uint32_t)0x00070000U)         /* !< TRIG C RX select specifies the RX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-C-RX */
#define USB_USBDMASEL_TRIGCRX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGCRX_EP1                ((uint32_t)0x00010000U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGCRX_EP2                ((uint32_t)0x00020000U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGCRX_EP3                ((uint32_t)0x00030000U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGCRX_EP4                ((uint32_t)0x00040000U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGCRX_EP5                ((uint32_t)0x00050000U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGCRX_EP6                ((uint32_t)0x00060000U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGCRX_EP7                ((uint32_t)0x00070000U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGCTX] Bits */
#define USB_USBDMASEL_TRIGCTX_OFS                (20)                            /* !< TRIGCTX Offset */
#define USB_USBDMASEL_TRIGCTX_MASK               ((uint32_t)0x00700000U)         /* !< TRIG C TX select specifies the TX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-C-TX */
#define USB_USBDMASEL_TRIGCTX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGCTX_EP1                ((uint32_t)0x00100000U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGCTX_EP2                ((uint32_t)0x00200000U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGCTX_EP3                ((uint32_t)0x00300000U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGCTX_EP4                ((uint32_t)0x00400000U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGCTX_EP5                ((uint32_t)0x00500000U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGCTX_EP6                ((uint32_t)0x00600000U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGCTX_EP7                ((uint32_t)0x00700000U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGDRX] Bits */
#define USB_USBDMASEL_TRIGDRX_OFS                (24)                            /* !< TRIGDRX Offset */
#define USB_USBDMASEL_TRIGDRX_MASK               ((uint32_t)0x07000000U)         /* !< TRIG D RX select specifies the RX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-D-RX */
#define USB_USBDMASEL_TRIGDRX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGDRX_EP1                ((uint32_t)0x01000000U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGDRX_EP2                ((uint32_t)0x02000000U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGDRX_EP3                ((uint32_t)0x03000000U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGDRX_EP4                ((uint32_t)0x04000000U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGDRX_EP5                ((uint32_t)0x05000000U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGDRX_EP6                ((uint32_t)0x06000000U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGDRX_EP7                ((uint32_t)0x07000000U)         /* !< Endpoint 7 */
/* USB_USBDMASEL[TRIGDTX] Bits */
#define USB_USBDMASEL_TRIGDTX_OFS                (28)                            /* !< TRIGDTX Offset */
#define USB_USBDMASEL_TRIGDTX_MASK               ((uint32_t)0x70000000U)         /* !< TRIG D TX select specifies the TX
                                                                                    mapping of the USB endpoint on DMA
                                                                                    trigger USB-D-TX */
#define USB_USBDMASEL_TRIGDTX_DIS                ((uint32_t)0x00000000U)         /* !< Disabled */
#define USB_USBDMASEL_TRIGDTX_EP1                ((uint32_t)0x10000000U)         /* !< Endpoint 1 */
#define USB_USBDMASEL_TRIGDTX_EP2                ((uint32_t)0x20000000U)         /* !< Endpoint 2 */
#define USB_USBDMASEL_TRIGDTX_EP3                ((uint32_t)0x30000000U)         /* !< Endpoint 3 */
#define USB_USBDMASEL_TRIGDTX_EP4                ((uint32_t)0x40000000U)         /* !< Endpoint 4 */
#define USB_USBDMASEL_TRIGDTX_EP5                ((uint32_t)0x50000000U)         /* !< Endpoint 5 */
#define USB_USBDMASEL_TRIGDTX_EP6                ((uint32_t)0x60000000U)         /* !< Endpoint 6 */
#define USB_USBDMASEL_TRIGDTX_EP7                ((uint32_t)0x70000000U)         /* !< Endpoint 7 */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_usb__include */
